app/controllers/api/anime_controller.rb

    def titles
        @anime = Anime.all
---
SELECT "anime".* FROM "anime"

    def show
        formatted_title = params[:title].split("-").join(" ")
        @anime = Anime.includes(:studio, reviews: [:author]).find_by(title: formatted_title)
---
SELECT  "anime".* FROM "anime" WHERE "anime"."title" = $1 LIMIT $2  [["title", "Kill la Kill"], ["LIMIT", 1]]