app/controllers/api/reviews_controller.rb

    def show
        @review = Review.includes(:anime).find_by(id: params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "anime".* FROM "anime" WHERE "anime"."id" = $1  [["id", 26]]

    def create
        @review = Review.new(review_params)
        @review.author_id = current_user.id

        if @review.save
            @anime = Anime.find_by(id: params[:review][:anime_id])
---
INSERT INTO "reviews" ("title", "body", "rating", "author_id", "anime_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."anime_id" = $1  [["anime_id", 26]]
SELECT  "anime".* FROM "anime" WHERE "anime"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

    def update
        @review = Review.find_by(id: params[:id])
        if @review.update(review_params)
            @anime = Anime.find_by(id: params[:review][:anime_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "reviews" SET "body" = $1, "rating" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["body", "fg"], ["rating", 4], ["updated_at", "2020-02-18 05:03:35.462061"], ["id", 25]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."anime_id" = $1  [["anime_id", 26]]
SELECT  "anime".* FROM "anime" WHERE "anime"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

    def destroy
        @review = Review.find_by(id: params[:id]).destroy
        @anime = Anime.find_by(title: params[:review][:anime])
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 24]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT  "anime".* FROM "anime" WHERE "anime"."title" = $1 LIMIT $2  [["title", "Kill la Kill"], ["LIMIT", 1]]