app/controllers/api/studios_controller.rb

SELECT "studios".* FROM "studios"
---
    def index
        @studios = Studio.all

SELECT  "studios".* FROM "studios" WHERE "studios"."name" = $1 LIMIT $2  [["name", "Studio Trigger"], ["LIMIT", 1]]
---
    def show
        formatted_name = params[:name].split("-").join(" ")
        @studio = Studio.includes(:produced_anime).find_by(name: formatted_name)