app/controllers/api/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def show
        @user = User.includes(:cart).find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def reviews
        @user = User.includes(authored_reviews: :anime).find_by(username: params[:username])
---
SELECT "anime".* FROM "anime" WHERE "anime"."id" IN ($1, $2)  [["id", 31], ["id", 27]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]

    def update
        @user = User.includes(:cart).find_by(id: params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$//E/FS/a3u.ajyXzLuR5Ru15mgebMtpvpwGnw02M629UTrP0W0r56"], ["updated_at", "2020-02-18 07:58:42.602711"], ["id", 12]]