app/views/api/anime/show.json.jbuilder

json.reviews do
    @anime.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."anime_id" = $1  [["anime_id", 26]]