app/models/anime.rb

    def self.pull_recs(recs_hash)
        titles = recs_hash.values
        anime = Anime.where("title IN (?)",titles)

        return_anime = []
        until return_anime.length == anime.length
---
SELECT "anime".* FROM "anime" WHERE (title IN ('Tengen Toppa Gurren Lagann','Little Witch Academia','Darling in the FranXX','Angel Beats!','Shirobako','Samurai Champloo','Kill la Kill'))

    def self.search_for(search_params)
        title = search_params[:title]
        studios = search_params[:studios]
        years = search_params[:years]

        genres = search_params[:genres]
        genres_search = genres.map {|g| "genre LIKE '%#{g}%'"}.join(" OR ") unless genres.nil?
---
SELECT "anime"."genre" FROM "anime"