app/models/user.rb

    def self.find_by_credentials(un_or_email,pw)
        likeEmail = false
        likeEmail = true if (un_or_email.split("@").length ==  2) && (!un_or_email.split("@")[0].include?(".")) && (un_or_email.split("@")[1].split(".").length == 2)
        user = likeEmail ? User.find_by(email: un_or_email) : User.find_by(username: un_or_email)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test3"], ["LIMIT", 1]]

    def self.has_an_account(un_or_email)
        likeEmail = false
        likeEmail = true if (un_or_email.split("@").length ==  2) && (!un_or_email.split("@")[0].include?(".")) && (un_or_email.split("@")[1].split(".").length == 2)
        user = likeEmail ? User.find_by(email: un_or_email) : User.find_by(username: un_or_email)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test3"], ["LIMIT", 1]]